<template>
  <div id="agreement">
    <el-dialog
      :visible.sync="show"
      width="90%"
    >
      <h3>《认种认养条款》</h3>
      <p>认种认养人通过网络页面点击确认接受本协议，即表示同意接受本协议的全部约定内容以及与本协议有关的已经发布或将来可能发布的各项规则、页面展示、操作流程、公告或通知等。</p>
      <p>为做好义务植树认种认养工作，根据《全民义务植树尽责形式管理办法（试行）》，结合我市义务植树实际,本着“自愿、公开、公正”的原则，达成如下协议，以期共同遵守。</p>
      <p>一、认种认养人通过植树尽责自愿捐资、认种认养申请捐资形式，委托有关部门（如：温州生态园管理委员会）代其履行植树义务。其中植树尽责捐资基数为20元，捐资可折算和抵扣当年义务植树法定任务，每20元折算完成1株植树任务，达到尽责株数（3株）的，您可以在相关服务页面查看对应的植树证书（如：全民义务植树尽责电子证书）。认种认养申请捐资金额以认种认养界面公告为准，实际支付金额超过（包含）60元的，亦可获得尽责证明证书。</p>
      <p>二、有关部门委托或指定种植养护单位统一进行种植和管养。认种认养的地点、范围、面积、规格树种、株数、资金、期限等按照有关部门义务植树认种认养公告确定。</p>
      <p>三、认种认养的树木、林地和绿地原有的性质权属不因认种认养关系的建立而改变。</p>
      <p>四、认种认养与植树尽责捐资主要用于认种认养活动的组织，认种认养树木种植、养护和管理，认种认养荣誉证书、公益牌制作，义务植树，城乡绿化工程建设等费用支出。</p>
      <p>五、在认种认养期内,认种认养人对所认种认养的树木、林地和绿地拥有知情权和监督权；种植养护单位未按种植养护协议标准进行种植或管养，导致树木、林地、绿地毁坏的,认种认养人有权要求整改，整改仍不符合规定植树标准的，认种认养人有权终止认种认养协议。有关部门每年提供当年所认种认养树木、林地和绿地的养护信息。</p>
      <p>六、在认种认养期间内，认种认养指定树木将悬挂写有认种认养人信息与寄语的公益牌。认种认养期限以项目公告为准，期满后，不再悬挂认种认养公益牌。如继续申请认种认养，将对公益牌信息进行更新。</p>
      <p>七、在认种认养期间，认种认养人未按协议要求履行岀资，或者毁坏林木，或者擅自增加建筑物、构筑物、标识、标牌，或开展其它经营活动的，有关部门有权终止其认种认养协议中的相关权利。</p>
      <p>八、为了进一步改善用户体验，本平台将会持续开发新服务，为用户提供版本升级、功能升级等服务和内容更新，本须知也可能会随之更新，更新内容将于公布之日起生效。若您选择继续使用本平台，表示您同意更新后的内容。若您不同意更新后的条款内容，您有权停止使用相关服务；双方协商一致的，也可另行变更相关服务和对应条款内容。如果更新的内容涉及您的主要权利或责任，我们会以公告、客户端通知或短信等方式向您进行提示。</p>
    </el-dialog>
  </div>
</template>

<script>
  import {Confirm, TransferDom,} from "vux";

export default {
  data() {
    return{
      show:false
    }
  },
  directives: {
    TransferDom,
  },
  components:{
    Confirm
  },
  methods:{
  },
};
</script>

<style lang="less" scoped>
@import "../../../assets/config/common.css";
#agreement {
  margin-left: 15px;
  margin-right: 15px;
  margin-bottom: 15px;
  h3 {
    text-align: center;
    font-size: 16px;
  }
}
* /deep/ .el-dialog{
  height: 60% !important;
  overflow-y: auto;
}
* /deep/ .el-dialog__body{
  padding-top: 0vh;
}
* /deep/ .el-dialog__header{
  padding: 0vh 0vh;
}
</style>
